---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeLeftSideSupportType
source: html/eaa30194-df64-a9d8-6080-52d41b54ec0e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeLeftSideSupportType Property

"Left Support Type": Left Side Support Type

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeLeftSideSupportType { get; }
```